import random


def регестрація():
    загадка = [
        ("ведіть пароль для регестрації", "12345"),
    ]
    текст, відповідь = random.choice(загадка)
    print(текст)
    return input("ваш пароль: ").lower() == відповідь.lower()


if регестрація():
    print("ви зарейстровані")
else:
    print("пароль не правильний, спробуйте ще раз")


def регестрація():
    загадка = [
        ("ведіть пароль для регестрації", "12345"),
    ]
    текст, відповідь = random.choice(загадка)
    print(текст)
    return input("ваш пароль: ").lower() == відповідь.lower()


if регестрація():
    print("ви зарейстровані")
else:
    print("пароль не правильний, спробуйте ще раз")


    def регестрація():
        загадка = [
            ("ведіть пароль для регестрації", "12345"),
        ]
        текст, відповідь = random.choice(загадка)
        print(текст)
        return input("ваш пароль: ").lower() == відповідь.lower()


    if регестрація():
        print("ви зарейстровані")
    else:
        print("пароль не правильний, спробуйте ще раз")


    def регестрація():
        загадка = [
            ("ведіть пароль для регестрації", "12345"),
        ]
        текст, відповідь = random.choice(загадка)
        print(текст)
        return input("ваш пароль: ").lower() == відповідь.lower()


    if регестрація():
        print("ви зарейстровані")
    else:
        print("пароль не правильний, спробуйте ще раз")
